ecorp/app/controllers/residence_controller.rb

  def show
  	@residence = Residence.all
---
SELECT "residences".* FROM "residences"