hsh/app/views/residencias/index.html.erb

SELECT "residencia".* FROM "residencia"
---

	<% residencias = Residencia.all %>